---
kind: property
id: P:Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.WidthDiameter
source: html/46e53de0-844b-6fa0-7c6a-fddc35d49da2.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.WidthDiameter Property

The width or diameter of the straight.

## Syntax (C#)
```csharp
public double WidthDiameter { get; set; }
```